In [1]:
from sqlalchemy import create_engine
import pymysql
import pandas as pd

In [5]:
print(f'pymysql version: {pymysql.__version__}')
print(f'pandas version: {pd.__version__}')

pymysql version: 0.9.3
pandas version: 0.23.4

In [16]:
uid='root'
#pwd='relational'
host='localhost'
port=3306
db='php_pdo'
con_string=f'mysql+pymysql://{uid}@{host}:{port}/{db}'
#con_string=f'mysql+pymysql://{uid}:{pwd}@{host}:{port}/{db}'
print(f'connection string = {con_string}')
con=create_engine(con_string)
# con = create_engine('mysql+pymysql://guest:relational@relational.fit.cvut.cz:3306/imdb_small')

connection string = mysql+pymysql://root@localhost:3306/php_pdo

In [17]:
con.table_names()

['book']

In [19]:
r = con.execute("select * from book limit 5;").fetchall()
r #list

[(1, 'PHP Programming', 'สมชาย', 250),
 (2, 'Java Programming', 'สมชาย', 900),
 (3, 'SQL Programming', 'สมหญิง', 850),
 (4, 'JavaScript Programming', 'สมชาติ', 300),
 (5, 'Python Programming', 'สมศักดิ์', 1220)]

In [21]:
sql = "select * from book limit 10;"
df = pd.read_sql(sql, con)
df #dataframe

   id                   title    author  price
0   1         PHP Programming     สมชาย    250
1   2        Java Programming     สมชาย    900
2   3         SQL Programming    สมหญิง    850
3   4  JavaScript Programming    สมชาติ    300
4   5      Python Programming  สมศักดิ์   1220
5   6              Networking     สมชาย   1220
6   7         Database Design     สมชาย    500

In [7]:
sql = """
    select year, count(id) as cnt 
        from movies 
        group by year 
        order by cnt desc 
        limit 5
"""
df = pd.read_sql(sql, con)
df

   year  cnt
0  1999    4
1  2000    4
2  2003    4
3  2001    3
4  1994    2

In [8]:
sql = """
    select * 
        from movies 
        where rank > %s 
        order by rank desc 
        limit 5
"""
#%s = params
df = pd.read_sql(sql, con, params=[8])
df

       id                       name  year  rank
0  297838  Shawshank Redemption, The  1994   9.0
1  130128             Godfather, The  1972   9.0
2  313459                  Star Wars  1977   8.8
3  210511                    Memento  2000   8.7
4  267038               Pulp Fiction  1994   8.7

In [9]:
sql = """
    select * 
        from movies 
        where rank > %s and year > %s
        order by rank desc 
        limit 5
"""
df = pd.read_sql(sql, con, params=[8, 2000])
df

       id               name  year  rank
0  176711  Kill Bill: Vol. 1  2003   8.4
1  124110       Garden State  2004   8.3
2  176712  Kill Bill: Vol. 2  2004   8.2
3  224842       Mystic River  2003   8.1
4  300229              Shrek  2001   8.1

In [10]:
sql = """
    select * 
        from movies 
        where rank > 8 and year > 2000
        order by rank desc 
        limit 5
"""
df = pd.read_sql(sql, con)
df

       id               name  year  rank
0  176711  Kill Bill: Vol. 1  2003   8.4
1  124110       Garden State  2004   8.3
2  176712  Kill Bill: Vol. 2  2004   8.2
3  224842       Mystic River  2003   8.1
4  300229              Shrek  2001   8.1

In [ ]:
sql =